tap "gigalixir/brew"
tap "homebrew/services"
tap "serokell/tezos-packaging-stable", "https://github.com/serokell/tezos-packaging-stable.git"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# B2 Cloud Storage Command-Line Tools
brew "b2-tools"
# Double-entry accounting tool that works on plain text files
brew "beancount"
# Language server for beancount files
brew "beancount-language-server"
# Core application library for C
brew "glib"
# Postgres C API library
brew "libpq"
# NaCl networking and cryptography library
brew "libsodium"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Load/unload environment variables based on $PWD
brew "direnv"
# Web interface for the double-entry bookkeeping software Beancount
brew "fava"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line tools for fly.io services
brew "flyctl"
# Automatic git commit --fixup
brew "git-absorb"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# C/C++ seam carving library
brew "liblqr"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Remote terminal application
brew "mosh"
# Password manager
brew "pass"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Zsh prompt for Astronauts
brew "spaceship"
# Open source continuous file synchronization application
brew "syncthing", restart_service: :changed
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Tracks most-used directories to make cd smarter
brew "z"
# Gigalixir CLI
brew "gigalixir/brew/gigalixir"
# CLI client for interacting with tezos blockchain
brew "serokell/tezos-packaging-stable/tezos-client"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# VPN client focusing on security
cask "protonvpn"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Customizable email client
cask "thunderbird"
# Open-source BitTorrent client
cask "transmission"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
